package lesson11;

public class Demo02 {
    public static void main(String[] args) {
        /**
         * final 关键字的学习
         * 修饰类, 类不能够被继承, 属于丁克的行为
         * 修饰变量, 这个变量就变成了常量, 只能被赋值一次
         * 修饰方法, 方法不能被重写
         *
         *
         * final 修饰变量叫做常量, 一般会与 public 和 static 公用
         *
         *
         * final 修饰局部变量的特点
         *
         * 1. 修饰基本类型, 是值不能改变
         * 2. 修饰引用数据类型, 地址值不能改变, 对象中的属性可以改变
         *
         *
         * 非静态 final 修饰变量的2个初始化时机
         *
         * 1. 一定义变量的时候就进行初始化
         * 2. 在构造方法里面进行初始化
         *
         */
    }
}
